#!/usr/bin/env python
# coding: utf-8

# # 演習問題

# ## プログラミングの基礎
# 
# 

# 「プログラミングの基礎」で触れた事柄に関する問題集です．

# ### 1-1 ほげ

# 

# In[ ]:





# ### 1-2 ほげ

# 

# In[ ]:





# ### 1-3 ほげ

# 

# In[ ]:





# ### 1-4 ほげ

# 

# In[ ]:





# ### 1-5 ほげ

# 

# In[ ]:





# ## scikit-learn を利用した機械学習
# 
# 

# 「scikit-learn を利用した機械学習」で触れた事柄に関する問題集です．

# ### 1-1 ほげ

# 

# In[ ]:





# ### 1-2 ほげ

# 

# In[ ]:





# ### 1-3 ほげ

# 

# In[ ]:





# ### 1-4 ほげ

# 

# In[ ]:





# ## 深層学習
# 
# 

# プログラミングの基礎で触れた事柄に関する問題集です．

# ### 1-1 ほげ

# 

# In[ ]:





# ### 1-2 ほげ

# 

# In[ ]:





# ### 1-3 ほげ

# 

# In[ ]:





# ### 1-4 ほげ

# 

# In[ ]:





# ### 1-1 ほげ

# 

# In[ ]:





# ### 1-2 ほげ

# 

# In[ ]:





# ### 1-3 ほげ

# 

# In[ ]:





# ### 1-4 ほげ

# 

# In[ ]:





# ```{note}
# 終わりです．
# ```
